/*$Id: srav.c,v 5.11 2013/05/17 14:56:42 sasa Exp $*/
/*27.03.2012  28.04.1987       Белых А.И.   srav.c
Программа сравнения двух символьных строчек
если вернули  0  строчки символов равны
если вернули -1 то не равны*/
#include	"util.h"

int SRAV(const char *N1,const char *N2,int N3) //0-полное сравнение 1 сравнение только первых символов
{
int     I,I2;
if(N1 == NULL && N2 == NULL)
 return(0);
if(N1 == NULL || N2 == NULL)
 return(-1);
 
if(N1[0] == '\0' && N2[0] == '\0')
  return(0);
I2=(-1);

if(N3 == 1)
 for(I = 0; N1[I] != '\0' &&  N2[I] != '\0'; I++)
   {
    I2=0;
    if( N1[I] != N2[I] )
     {
      I2=(-1);
      break;
     }
   }
else
 for(I = 0; N1[I] != '\0' ||  N2[I] != '\0'; I++)
   {
    I2=0;
    if( N1[I] != N2[I] )
     {
      I2=(-1);
      break;
     }
   }
return(I2);
}
