/*$Id: in_d12_start.c,v 5.6 2013/05/17 14:56:03 sasa Exp $*/
/*14.07.2015	23.10.2007	Белых А.И.	in_d12_start.c
Вывод шапки документа
Возвращает количество строк выведенных в файл
*/
#include "buhg.h"

int in_d12_start(FILE *ff)
{
int kolstr=iceb_t_insfil("in_d12_start.alx",ff);

fprintf(ff,"\
----------------------------------------------------------------------------------------------------------------------\n\
N за |      Найменування            |Значиться в інвентаризаці-| Фактична наявність       |     Результат:           |\n\
опи- |       цінностей              |йному описі               |                          |(+)лишки, (-)недостачі    |\n\
сом  |                              |--------------------------------------------------------------------------------|\n\
     |                              | Кількість|Ціна|  Сумма   | Кількість|Ціна|  Сумма   | Кількість|Ціна|  Сумма   |\n\
----------------------------------------------------------------------------------------------------------------------\n");

kolstr+=6;

return(kolstr);


}

