/*$Id: spkvd.c,v 5.3 2013/05/17 14:56:12 sasa Exp $*/
/*02.08.2011	02.08.2011	Белых А.И.	spkvd.c
 Выдача шапки
*******************/
#include <stdio.h>

void spkvd(int *klst,FILE *ff1)
{

*klst+=5;

fprintf(ff1,"\x1B\x2D\x30"); /*Выключить подчеркивание*/
fprintf(ff1,"\
------------------------------------------------------------------------------------------------------------\n\
N п/п|Ідентифі- |Сума нар. |Сума  вип.|Сума  нар.|Сума  пер.|Ознака|     Д а т а         |  Ознака  |Ознака|\n\
     |каційний  | доходу   | доходу   |приб.подат|приб.подат|доходу|---------------------|подат.соц.|(0,1) |\n\
     |  номер   |(грн.коп.)|(грн.коп.)|(грн.коп.)|(грн.коп.)|      |прийняття |звільнення|  пільги  |      |\n\
------------------------------------------------------------------------------------------------------------");
fprintf(ff1,"\x1B\x2D\x31\n"); /*Включить подчеркивание*/

}
