/*$Id: sspp1.c,v 5.10 2013-01-02 10:38:36 sasa Exp $*/
/*10.09.2018	18.02.2003	Белых А.И.	sspp1.c
Шапка платежной ведомости
*/
#include        "buhg.h"

void sspp1(FILE *kaw1,int list,int *kolstr)
{

if(list > 1)
  fprintf(kaw1,"\f");

fprintf(kaw1,"%53s %d %s\n","",list,gettext("страница ведомости"));
fprintf(kaw1,"\
--------------------------------------------------------------------------------\n");
fprintf(kaw1,"\
 N |Табельний|  Призвище, ім'я, по батькові     |  Сума    |Підпис про|Примітка|\n\
з/п|  номер  |                                  |          |одерження |        |\n");
fprintf(kaw1,"\
--------------------------------------------------------------------------------\n");
fprintf(kaw1,"\
 1 |    2    |               3                  |    4     |    5     |    6   |\n");
fprintf(kaw1,"\
--------------------------------------------------------------------------------\n");
*kolstr+=7;
}
