/* $Id: tabel.c,v 5.17 2013/08/13 05:49:56 sasa Exp $ */
/*28.03.2018    28.02.1994      Белых А.И.      tabel.c
Получение распечатки табеля
*/
#include        <errno.h>
#include        "buhg.h"

void            gsaptb(int*,int*,FILE*);
void tabel_sap(int *kol_strok,FILE *kaw);

#define         PL      65  /*Количество строк на листе*/
extern short    mmm,ggg;
extern int kol_strok_na_liste;

void            tabel()
{
FILE            *kaw;
class iceb_tu_str kod("");
class iceb_tu_str podraz("");
char            imaf[64];
int           sl;
long            tabn;
short           podr;
short           kateg;
short           nst;
short           kp;
class iceb_tu_str dolg("");
long		kolstr,kolstr1;
SQL_str         row;
char		strsql[512];
short		d,m,g;
//int		poz,komv;

clear();

move(1,0);
printw(gettext("Виберите подразделение для которого нужно распечатать табель"));

kp=0;
//poz=komv=0;

if(dirzarpodr(2,&kod,&podraz) == 0)
 {
  kp=kod.ravno_atoi();
 }
else
 {
  return;
 }

clear();
GDITE();

sprintf(strsql,"select tabn,fio,datk,podr,kateg,dolg from Kartb \
where podr=%d order by podr,tabn asc",kp);
class SQLCURSOR cur;

if((kolstr=cur.make_cursor(&bd,strsql)) < 0)
 {
  msql_error(&bd,gettext("Ошибка создания курсора !"),strsql);
  return;
 }

if(kolstr == 0)
 {
  iceb_t_soob(gettext("Не найдено ни одной записи !"));
  return;
 }

sprintf(imaf,"tab%d.lst",getpid());
if((kaw = fopen(imaf,"w")) == NULL)
 {
  error_op_nfil(imaf,errno,"");
  return;
 }

fprintf(kaw,"\
%s %s - %s\n\n\
                                                                                         %s\n\
                                                                            %s\n\
                                                                                     за %02d.%dр.\n\n",
iceb_t_get_pnk("00",0),
gettext("Подразделение"),
podraz.ravno(),
gettext("ТАБЕЛЬ"),
gettext("учёта использования рабочего времени"),
mmm,ggg);
int kol_strok=6;

tabel_sap(&kol_strok,kaw);

nst=0;
sl=1;
kolstr1=0;
while(cur.read_cursor(&row) != 0)
 {
  kolstr1++;
  strzag(LINES-1,0,kolstr,kolstr1);  
  tabn=atol(row[0]);

  /*Дата увольнения*/
  if(rsdat(&d,&m,&g,row[2],2) == 0)
    continue;


  /*Подразделение*/
  podr=atoi(row[3]);
  if(kp != 0)
   if(kp != podr)
     continue;

  /*Категория*/
  kateg=atoi(row[4]);

  /*Должность*/
  dolg.new_plus(row[5]);


  nst++;

  printw("%5ld %s\n",tabn,row[1]);

  gsaptb(&sl,&kol_strok,kaw);

  fprintf(kaw,"\
 %02d %02d %02d %-5ld %-*.*s %-*.*s|   |  |    |   |   |   |   |   |  |   |      |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |\n\
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
  podr,nst,kateg,tabn,
  iceb_tu_kolbait(30,row[1]),iceb_tu_kolbait(30,row[1]),row[1],
  iceb_tu_kolbait(15,dolg.ravno()),iceb_tu_kolbait(15,dolg.ravno()),dolg.ravno());



 }

podpis(kaw);

fclose(kaw);
printw("\n%s %d\n%s \"%s\".\n\n",
gettext("Количество листов"),sl,
gettext("Распечатка выгружена в файл"),imaf);
OSTANOV();
class spis_oth oth;
oth.spis_imaf.plus(imaf);
oth.spis_naim.plus(gettext("Заготовка для табеля."));

iceb_t_ustpeh(imaf,0);

iceb_t_rabfil(&oth,"");
}
/*******/
/*Шапка*/
/*******/
void            gsaptb(int *sl,int *kol_strok,FILE *kaw)
{
*kol_strok+=2;
if(*kol_strok <= kol_strok_na_liste)
 return;

fprintf(kaw,"\f");
*sl+=1;
*kol_strok=2;
tabel_sap(kol_strok,kaw);


}
/*********************/
/*печать шапки*/
/******************/
void tabel_sap(int *kol_strok,FILE *kaw)
{

*kol_strok+=10;

fprintf(kaw,"\
=============================================================================================================================================================================================================================================================\n");
/*************
fprintf(kaw,gettext("|  |Н |К |     |                              |               |   |  |    |Ночные |Вечерн.|Друг.виды оплаты |Пс|                                Д н и   м е с я ц а                                         |К |О |С |Б |Д |А |У |П |Го|  |Вп|Дв| Н/д |И |И |\n"));
fprintf(kaw,gettext("|У |о |а |     |                              |               |   |  |    |-------|-------|-----------------|ро|                                                                                            |о |т |п |о |р |д |ч |р |об|  |ыр|оы|-----|т |тн|\n"));
fprintf(kaw,gettext("|ч |мс|т | Та- |      Ф а м и л и я           |               |  о|  | Ч  |В о| Ч |В о| Ч |В о|Д | Ч |      |ив|--------------------------------------------------------------------------------------------|мо|п |р |л |у |м |е |о |ся|  |ха|пх|  |Пт|о |ое|\n"));
fprintf(kaw,gettext("|а |ет|ег|бель |          И м я               |  Должность    |В п|Д | а  |и п| а |и п| а |и п|н | а |      |зм|  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |ав|у |а |ь |г |и |б |г |уз|  |оз|оо|  |ок|г |г |\n"));
fprintf(kaw,gettext("|с |рр| о| ный |      О т ч е с т в о         |               |и л|н | с  |д л| с |д л| с |д л|и | с | Сумма|не|  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |нк|с |в |н |и |н |н |у |да|  |дд|лд|  |до|оя|оя|\n"));
fprintf(kaw,gettext("|т | о| р|номер|                              |               |д а|и | ы  |  а| ы |  а| ы |  а|  | ы | грн. |ас|01|02|03|04|05|06|07|08|09|10|11|12|13|14|15|16|17|18|19|20|21|22|23|24|25|26|27|28|29|30|31|ди|к |к |и |е |и |ы |л |ан|  |нн|нн|  |рв| в| в|\n"));
fprintf(kaw,gettext("|о | к| и|     |                              |               |  т|  |    |  т|   |  т|   |  т|  |   |      |кт|  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |и |  |и |ч |  |с |е |ы |рс|  |ы.|иы|  |оы| о| о|\n"));
fprintf(kaw,gettext("|к | и| я|     |                              |               |  ы|  |    |  ы|   |  ы|   |  ы|  |   |      | .|  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |р |  |  |. |  |т |  |  |..|  |е |.е|  |се| к| к|\n"));
*************/
fprintf(kaw,gettext("|  |Н |К |     |                              |               |   |  |    |Ночные |Вечерн.|Друг.виды оплаты |Пс|                                Д н и   м е с я ц а                                         |К |О |С |Б |Д |А |У |П |Го|  |Вп|Дв| Н/д |И |И |\n\
|У |о |а |     |                              |               |   |  |    |-------|-------|-----------------|ро|                                                                                            |о |т |п |о |р |д |ч |р |об|  |ыр|оы|-----|т |тн|\n\
|ч |мс|т | Та- |      Ф а м и л и я           |               |  о|  | Ч  |В о| Ч |В о| Ч |В о|Д | Ч |      |ив|--------------------------------------------------------------------------------------------|мо|п |р |л |у |м |е |о |ся|  |ха|пх|  |Пт|о |ое|\n\
|а |ет|ег|бель |          И м я               |  Должность    |В п|Д | а  |и п| а |и п| а |и п|н | а |      |зм|  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |ав|у |а |ь |г |и |б |г |уз|  |оз|оо|  |ок|г |г |\n\
|с |рр| о| ный |      О т ч е с т в о         |               |и л|н | с  |д л| с |д л| с |д л|и | с | Сумма|не|  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |нк|с |в |н |и |н |н |у |да|  |дд|лд|  |до|оя|оя|\n\
|т | о| р|номер|                              |               |д а|и | ы  |  а| ы |  а| ы |  а|  | ы | грн. |ас|01|02|03|04|05|06|07|08|09|10|11|12|13|14|15|16|17|18|19|20|21|22|23|24|25|26|27|28|29|30|31|ди|к |к |и |е |и |ы |л |ан|  |нн|нн|  |рв| в| в|\n\
|о | к| и|     |                              |               |  т|  |    |  т|   |  т|   |  т|  |   |      |кт|  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |и |  |и |ч |  |с |е |ы |рс|  |ы.|иы|  |оы| о| о|\n\
|к | и| я|     |                              |               |  ы|  |    |  ы|   |  ы|   |  ы|  |   |      | .|  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |р |  |  |. |  |т |  |  |..|  |е |.е|  |се| к| к|\n"));

fprintf(kaw,"\
=============================================================================================================================================================================================================================================================\n");

}




